title: Attempted Credential Dump From Registry via Reg exe
id:
status: experimental
description:
references:
tags:
  - attack.Credential Access
  - attack.T1003
  - attack.T1003.002
author:
date:
logsource:
  category:
  product:
detection:
  selection:
    FieldName:
  condition:
fields:
  - _time
  - Processes.dest
  - Processes.user
  - Processes.parent_process_name
  - Processes.parent_process
  - Processes.original_file_name
  - Processes.process_name
  - Processes.process
  - Processes.process_id
  - Processes.parent_process_path
  - Processes.process_path
  - Processes.parent_process_id
falsepositives:
  - describe possible false positive conditions to help the analysts in their investigation
level: one of five levels (informational, low, medium, high, critical)
risk_score:
dataset:
platform: Splunk
platform query:
  helix:
  splunk: '| tstats `security_content_summariesonly` count min(_time) as firstTime
    max(_time) as lastTime from datamodel=Endpoint.Processes where `process_reg` OR
    `process_cmd` Processes.process=*save* (Processes.process=*HKEY_LOCAL_MACHINE\\Security*
    OR Processes.process=*HKEY_LOCAL_MACHINE\\SAM* OR Processes.process=*HKEY_LOCAL_MACHINE\\System*
    OR Processes.process=*HKLM\\Security* OR Processes.process=*HKLM\\System* OR Processes.process=*HKLM\\SAM*)
    by Processes.dest Processes.user Processes.parent_process Processes.process_name
    Processes.original_file_name Processes.process Processes.process_id Processes.parent_process_id
    | `drop_dm_object_name(Processes)` | `security_content_ctime(firstTime)`| `security_content_ctime(lastTime)`
    | `attempted_credential_dump_from_registry_via_reg_exe_filter`'
platform description:
  helix:
  splunk: Monitor for execution of reg.exe with parameters specifying an export of
    keys that contain hashed credentials that attackers may try to crack offline.
platform id:
  helix:
  splunk: e9fb4a59-c5fb-440a-9f24-191fbc6b2911
platform references:
  helix:
  splunk:
    - https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1003.002/T1003.002.md#atomic-test-1---registry-dump-of-sam-creds-and-secrets
platform confidence:
  helix:
  splunk: 100
platform risk:
  helix:
  splunk: 90
platform severity:
  helix:
  splunk: Nil
